In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.read_csv('WorldCupMatches.csv')

In [3]:
data.head(5)

,Year,Datetime,Stage,Stadium,City,Home Team Name,Home Team Goals,Away Team Goals,Away Team Name,Win conditions,Attendance,Half-time Home Goals,Half-time Away Goals,Referee,Assistant 1,Assistant 2,RoundID,MatchID,Home Team Initials,Away Team Initials
0,1930.0,13 Jul 1930 - 15:00,Group 1,Pocitos,Montevideo,France,4.0,1.0,Mexico,,4444.0,3.0,0.0,LOMBARDI Domingo (URU),CRISTOPHE Henry (BEL),REGO Gilberto (BRA),201.0,1096.0,FRA,MEX
1,1930.0,13 Jul 1930 - 15:00,Group 4,Parque Central,Montevideo,USA,3.0,0.0,Belgium,,18346.0,2.0,0.0,MACIAS Jose (ARG),MATEUCCI Francisco (URU),WARNKEN Alberto (CHI),201.0,1090.0,USA,BEL
2,1930.0,14 Jul 1930 - 12:45,Group 2,Parque Central,Montevideo,Yugoslavia,2.0,1.0,Brazil,,24059.0,2.0,0.0,TEJADA Anibal (URU),VALLARINO Ricardo (URU),BALWAY Thomas (FRA),201.0,1093.0,YUG,BRA
3,1930.0,14 Jul 1930 - 14:50,Group 3,Pocitos,Montevideo,Romania,3.0,1.0,Peru,,2549.0,1.0,0.0,WARNKEN Alberto (CHI),LANGENUS Jean (BEL),MATEUCCI Francisco (URU),201.0,1098.0,ROU,PER
4,1930.0,15 Jul 1930 - 16:00,Group 1,Parque Central,Montevideo,Argentina,1.0,0.0,France,,23409.0,0.0,0.0,REGO Gilberto (BRA),SAUCEDO Ulises (BOL),RADULESCU Constantin (ROU),201.0,1085.0,ARG,FRA

In [7]:
data.shape

(4572, 20)

In [8]:
data.columns #features

Index(['Year', 'Datetime', 'Stage', 'Stadium', 'City', 'Home Team Name',
       'Home Team Goals', 'Away Team Goals', 'Away Team Name',
       'Win conditions', 'Attendance', 'Half-time Home Goals',
       'Half-time Away Goals', 'Referee', 'Assistant 1', 'Assistant 2',
       'RoundID', 'MatchID', 'Home Team Initials', 'Away Team Initials'],
      dtype='object')

### Checking missing values

In [17]:
#check for missing values
data.isnull().any() 
#It is observed that every column has missing values

Year                    True
Datetime                True
Stage                   True
Stadium                 True
City                    True
Home Team Name          True
Home Team Goals         True
Away Team Goals         True
Away Team Name          True
Win conditions          True
Attendance              True
Half-time Home Goals    True
Half-time Away Goals    True
Referee                 True
Assistant 1             True
Assistant 2             True
RoundID                 True
MatchID                 True
Home Team Initials      True
Away Team Initials      True
dtype: bool

### Handling missing values
#### 1. Drop rows having null values
#### 2. Fill missing values with mean/median/mode or any relevant value

In [19]:
# Dropping null rows
data.dropna(inplace=True)
data.isnull().any()
#No null values now

Year                    False
Datetime                False
Stage                   False
Stadium                 False
City                    False
Home Team Name          False
Home Team Goals         False
Away Team Goals         False
Away Team Name          False
Win conditions          False
Attendance              False
Half-time Home Goals    False
Half-time Away Goals    False
Referee                 False
Assistant 1             False
Assistant 2             False
RoundID                 False
MatchID                 False
Home Team Initials      False
Away Team Initials      False
dtype: bool

In [20]:
print(data.shape)

(850, 20)

In [23]:
#Filling with mean
data['Year'].replace(np.NaN, data['Year'].mean());
data['Year'].isnull().any() #No null value in 'Year' column

False

### Handling categorical variables

In [158]:
data2 = pd.read_csv('Data.csv')
data2.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [159]:
data2['Country'].unique()

array(['France', 'Spain', 'Germany'], dtype=object)

In [160]:
from sklearn.preprocessing import LabelEncoder
label_encoder = LabelEncoder()

In [161]:
data_LE = data2.copy()
data_LE['Country'] = label_encoder.fit_transform(data_LE['Country'])
data_LE['Purchased'] = label_encoder.fit_transform(data_LE['Purchased'])

In [162]:
data_LE.head()

   Country   Age   Salary  Purchased
0        0  44.0  72000.0          0
1        2  27.0  48000.0          1
2        1  30.0  54000.0          0
3        2  38.0  61000.0          0
4        1  40.0      NaN          1

In [163]:
data_LE_df = pd.DataFrame(data_LE)

In [164]:
data_LE_df.dropna(inplace=True)

In [165]:
data_LE_df

   Country   Age   Salary  Purchased
0        0  44.0  72000.0          0
1        2  27.0  48000.0          1
2        1  30.0  54000.0          0
3        2  38.0  61000.0          0
5        0  35.0  58000.0          1
7        0  48.0  79000.0          1
8        1  50.0  83000.0          0
9        0  37.0  67000.0          1

In [169]:
country_onehot = pd.get_dummies(data2['Country'])

In [171]:
country_onehot.head()

   France  Germany  Spain
0       1        0      0
1       0        0      1
2       0        1      0
3       0        0      1
4       0        1      0

In [175]:
new_df = pd.concat([data2,country_onehot], axis=1)

In [177]:
new_df.head() #ONE HOT ENCODED (COUNTRIES)

   Country   Age   Salary Purchased  France  Germany  Spain
0   France  44.0  72000.0        No       1        0      0
1    Spain  27.0  48000.0       Yes       0        0      1
2  Germany  30.0  54000.0        No       0        1      0
3    Spain  38.0  61000.0        No       0        0      1
4  Germany  40.0      NaN       Yes       0        1      0

### Splitting into training and testing sets

In [213]:
from sklearn.cross_validation import train_test_split
X_train, X_test, y_train, y_test = train_test_split(data_LE_df.drop(['Purchased'],axis=1),data_LE_df['Purchased'],test_size=0.2)

In [214]:
X_train.head()

   Country   Age   Salary
1        2  27.0  48000.0
5        0  35.0  58000.0
2        1  30.0  54000.0
3        2  38.0  61000.0
0        0  44.0  72000.0

In [215]:
y_train.head()

1    1
5    1
2    0
3    0
0    0
Name: Purchased, dtype: int64

### Feature Scaling

In [216]:
from sklearn.preprocessing import StandardScaler
standard_X = StandardScaler()

In [220]:
X_train = standard_X.fit_transform(X_train)
X_test = standard_X.fit_transform(X_test)

In [222]:
pd.DataFrame(X_train) #SCALED

          0         1         2
0  1.224745 -1.313512 -1.258170
1 -1.224745 -0.296600 -0.400327
2  0.000000 -0.932170 -0.743464
3  1.224745  0.084743 -0.142974
4 -1.224745  0.847427  0.800654
5  0.000000  1.610112  1.744282